performance/mysql8-jemalloc-profiling/logs/jemalloc521-profiling_19_26.run.oltp_read_only.256.2021-08-31_074124.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,256,14647.06,236926.10,207385.18,0.00,29540.93,44.17,0.00,0.00
2,256,15638.32,250243.17,218971.53,0.00,31271.65,18.28,0.00,0.00
3,256,15680.20,250905.26,219541.85,0.00,31363.41,17.95,0.00,0.00
4,256,15783.33,252643.26,221071.60,0.00,31571.66,17.95,0.00,0.00
5,256,15785.43,252451.91,220887.05,0.00,31564.86,17.95,0.00,0.00
6,256,15779.60,252500.61,220936.41,0.00,31564.20,17.95,0.00,0.00
7,256,15780.78,252465.42,220904.87,0.00,31560.55,17.95,0.00,0.00
8,256,15776.25,252493.96,220937.46,0.00,31556.50,17.95,0.00,0.00
9,256,15779.77,252475.34,220920.80,0.00,31554.54,17.95,0.00,0.00
10,256,15786.79,252479.67,220906.09,0.00,31573.59,17.95,0.00,0.00
11,256,15771.32,252359.18,220816.53,0.00,31542.65,17.95,0.00,0.00
12,256,15777.16,252483.52,220930.21,0.00,31553.32,17.95,0.00,0.00
13,256,15784.67,252490.78,220915.43,0.00,31575.35,17.95,0.00,0.00
14,256,15785.24,252623.77,221058.30,0.00,31565.47,17.95,0.00,0.00
15,256,15780.24,252492.77,220928.30,0.00,31564.47,17.95,0.00,0.00
16,256,15784.92,252497.80,220931.95,0.00,31565.85,17.95,0.00,0.00
17,256,15781.42,252470.73,220909.89,0.00,31560.84,17.95,0.00,0.00
18,256,15781.20,252553.23,220987.83,0.00,31565.40,17.95,0.00,0.00
19,256,15788.23,252625.70,221046.24,0.00,31579.46,17.95,0.00,0.00
20,256,15785.22,252545.45,220972.02,0.00,31573.43,17.95,0.00,0.00
21,256,15773.31,252424.89,220884.28,0.00,31540.61,17.95,0.00,0.00
22,256,15771.49,252379.76,220836.79,0.00,31542.97,17.95,0.00,0.00
23,256,15783.10,252476.64,220911.43,0.00,31565.20,17.95,0.00,0.00
24,256,15782.22,252458.45,220891.02,0.00,31567.43,17.95,0.00,0.00
25,256,15777.58,252538.25,220981.10,0.00,31557.16,17.95,0.00,0.00
26,256,15777.18,252403.96,220850.59,0.00,31553.37,17.95,0.00,0.00
27,256,15787.13,252565.15,220995.88,0.00,31569.27,17.95,0.00,0.00
28,256,15777.01,252481.10,220924.09,0.00,31557.01,17.95,0.00,0.00
29,256,15777.17,252466.70,220915.36,0.00,31551.34,17.95,0.00,0.00
30,256,15791.94,252611.99,221024.11,0.00,31587.87,17.95,0.00,0.00
31,256,15775.75,252360.93,220811.44,0.00,31549.49,17.95,0.00,0.00
32,256,15783.23,252522.61,220957.16,0.00,31565.45,17.95,0.00,0.00
33,256,15776.92,252519.68,220965.85,0.00,31553.83,17.95,0.00,0.00
34,256,15780.33,252511.30,220946.64,0.00,31564.66,17.95,0.00,0.00
35,256,15781.87,252407.85,220845.11,0.00,31562.73,17.95,0.00,0.00
36,256,15780.60,252489.64,220932.44,0.00,31557.21,17.95,0.00,0.00
37,256,15779.89,252574.33,221013.54,0.00,31560.79,17.95,0.00,0.00
38,256,15784.80,252400.79,220828.19,0.00,31572.60,17.95,0.00,0.00
39,256,15768.19,252428.94,220892.56,0.00,31536.37,17.95,0.00,0.00
40,256,15784.60,252524.52,220963.33,0.00,31561.19,17.95,0.00,0.00
41,256,15784.39,252436.28,220860.49,0.00,31575.78,17.95,0.00,0.00
42,256,15781.94,252512.07,220951.18,0.00,31560.88,17.95,0.00,0.00
43,256,15769.01,252479.21,220935.18,0.00,31544.03,17.95,0.00,0.00
44,256,15786.99,252453.93,220882.94,0.00,31570.99,17.95,0.00,0.00
45,256,15775.70,252471.28,220919.87,0.00,31551.41,17.95,0.00,0.00
46,256,15993.08,255862.26,223875.10,0.00,31987.16,17.95,0.00,0.00
47,256,15832.26,253371.15,221707.63,0.00,31663.52,17.95,0.00,0.00
48,256,15823.86,253244.75,221593.03,0.00,31651.72,17.95,0.00,0.00
49,256,15841.92,253199.76,221525.91,0.00,31673.85,17.95,0.00,0.00
50,256,15818.02,253290.28,221650.24,0.00,31640.04,17.95,0.00,0.00
51,256,15814.06,253003.97,221374.85,0.00,31629.12,17.95,0.00,0.00
52,256,15817.39,253063.29,221432.50,0.00,31630.79,17.95,0.00,0.00
53,256,15809.97,253025.57,221401.63,0.00,31623.95,17.95,0.00,0.00
54,256,15822.36,253014.74,221376.02,0.00,31638.72,17.95,0.00,0.00
55,256,15808.89,252949.29,221328.50,0.00,31620.79,17.95,0.00,0.00
56,256,15798.72,252881.45,221281.02,0.00,31600.43,17.95,0.00,0.00
57,256,15794.49,252702.78,221111.81,0.00,31590.97,17.95,0.00,0.00
58,256,15805.83,252837.35,221229.69,0.00,31607.67,17.95,0.00,0.00
59,256,15787.47,252746.52,221164.58,0.00,31581.94,17.95,0.00,0.00
60,256,15803.26,252820.10,221215.59,0.00,31604.51,17.95,0.00,0.00
61,256,15809.29,252802.71,221188.12,0.00,31614.59,17.95,0.00,0.00
62,256,15788.77,252765.40,221188.85,0.00,31576.55,17.95,0.00,0.00
63,256,15807.36,252810.82,221195.09,0.00,31615.73,17.95,0.00,0.00
64,256,15816.39,253107.20,221470.42,0.00,31636.77,17.95,0.00,0.00
65,256,15803.39,252820.23,221221.45,0.00,31598.78,17.95,0.00,0.00
66,256,15795.15,252738.37,221142.08,0.00,31596.30,17.63,0.00,0.00
67,256,15801.98,252811.66,221205.70,0.00,31605.96,17.63,0.00,0.00
68,256,15789.70,252653.27,221077.86,0.00,31575.41,17.63,0.00,0.00
69,256,15782.17,252603.68,221037.34,0.00,31566.33,17.63,0.00,0.00
70,256,15801.14,252766.17,221159.90,0.00,31606.27,17.63,0.00,0.00
71,256,15796.97,252769.45,221178.52,0.00,31590.93,17.63,0.00,0.00
72,256,15796.28,252639.54,221046.97,0.00,31592.57,17.63,0.00,0.00
73,256,15793.66,252696.49,221111.18,0.00,31585.31,17.63,0.00,0.00
74,256,15784.79,252674.65,221101.06,0.00,31573.58,17.63,0.00,0.00
75,256,15798.31,252699.95,221105.33,0.00,31594.62,17.63,0.00,0.00
76,256,15792.51,252769.16,221184.14,0.00,31585.02,17.63,0.00,0.00
77,256,15784.86,252591.72,221022.00,0.00,31569.71,17.63,0.00,0.00
78,256,15797.59,252648.38,221057.21,0.00,31591.17,17.63,0.00,0.00
79,256,15790.27,252593.34,221007.80,0.00,31585.54,17.63,0.00,0.00
80,256,15777.22,252617.55,221061.11,0.00,31556.45,17.63,0.00,0.00
81,256,15798.17,252615.71,221025.37,0.00,31590.34,17.63,0.00,0.00
82,256,15786.18,252632.85,221057.49,0.00,31575.36,17.63,0.00,0.00
83,256,15789.63,252590.06,221013.80,0.00,31576.26,17.63,0.00,0.00
84,256,15788.05,252636.86,221061.76,0.00,31575.11,17.63,0.00,0.00
85,256,15795.32,252713.19,221120.54,0.00,31592.65,17.63,0.00,0.00
86,256,15780.94,252622.09,221058.20,0.00,31563.88,17.63,0.00,0.00
87,256,15781.47,252461.57,220898.62,0.00,31562.95,17.63,0.00,0.00
88,256,15782.78,252492.44,220925.88,0.00,31566.55,17.63,0.00,0.00
89,256,15794.58,252602.26,221017.10,0.00,31585.16,17.63,0.00,0.00
90,256,15776.36,252528.82,220975.09,0.00,31553.73,17.63,0.00,0.00
91,256,15779.08,252456.33,220900.16,0.00,31556.17,17.63,0.00,0.00
92,256,15793.12,252556.96,220969.72,0.00,31587.25,17.63,0.00,0.00
93,256,15761.68,252465.76,220938.41,0.00,31527.36,17.63,0.00,0.00
94,256,15791.83,252520.31,220940.64,0.00,31579.67,17.63,0.00,0.00
95,256,15781.38,252579.08,221012.32,0.00,31566.76,17.63,0.00,0.00
96,256,15787.53,252552.54,220976.48,0.00,31576.07,17.63,0.00,0.00
97,256,15777.34,252438.36,220886.69,0.00,31551.67,17.63,0.00,0.00
98,256,15782.03,252499.45,220936.39,0.00,31563.06,17.63,0.00,0.00
99,256,15781.47,252441.49,220878.56,0.00,31562.94,17.63,0.00,0.00
100,256,15779.50,252466.96,220911.96,0.00,31554.99,17.63,0.00,0.00
101,256,15787.05,252509.83,220932.73,0.00,31577.10,17.63,0.00,0.00
102,256,15765.53,252410.41,220874.36,0.00,31536.05,17.63,0.00,0.00
103,256,15776.44,252417.96,220867.09,0.00,31550.87,17.63,0.00,0.00
104,256,15786.43,252513.94,220941.07,0.00,31572.87,17.63,0.00,0.00
105,256,15775.16,252448.54,220900.23,0.00,31548.32,17.63,0.00,0.00
106,256,15773.11,252431.77,220883.55,0.00,31548.22,17.63,0.00,0.00
107,256,15789.44,252620.02,221042.15,0.00,31577.88,17.63,0.00,0.00
108,256,15783.31,252478.89,220910.28,0.00,31568.61,17.63,0.00,0.00
109,256,15776.39,252422.27,220867.49,0.00,31554.78,17.63,0.00,0.00
110,256,15773.40,252425.47,220881.66,0.00,31543.81,17.63,0.00,0.00
111,256,15781.17,252440.72,220877.38,0.00,31563.34,17.63,0.00,0.00
112,256,15782.15,252436.34,220873.05,0.00,31563.29,17.63,0.00,0.00
113,256,15772.16,252508.57,220965.25,0.00,31543.32,17.63,0.00,0.00
114,256,15786.44,252501.96,220931.09,0.00,31570.87,17.63,0.00,0.00
115,256,15769.47,252350.57,220807.63,0.00,31542.95,17.63,0.00,0.00
116,256,15778.34,252381.40,220830.73,0.00,31550.68,17.63,0.00,0.00
117,256,15779.77,252501.35,220937.80,0.00,31563.54,17.63,0.00,0.00
118,256,15777.51,252452.09,220898.08,0.00,31554.01,17.63,0.00,0.00
119,256,15771.27,252320.37,220777.83,0.00,31542.55,17.63,0.00,0.00
120,256,15774.64,252435.27,220883.99,0.00,31551.28,17.63,0.00,0.00
121,256,15777.66,252417.49,220861.18,0.00,31556.31,17.63,0.00,0.00
122,256,15774.42,252416.72,220868.88,0.00,31547.84,17.63,0.00,0.00
123,256,15782.13,252475.15,220909.89,0.00,31565.27,17.63,0.00,0.00
124,256,15773.58,252405.27,220860.11,0.00,31545.16,17.63,0.00,0.00
125,256,15770.88,252439.05,220895.29,0.00,31543.76,17.63,0.00,0.00
126,256,15785.87,252413.95,220851.21,0.00,31562.74,17.63,0.00,0.00
127,256,15772.99,252422.91,220869.92,0.00,31552.99,17.63,0.00,0.00
128,256,15781.22,252483.55,220923.10,0.00,31560.44,17.63,0.00,0.00
129,256,15778.49,252427.91,220865.92,0.00,31561.99,17.63,0.00,0.00
130,256,15758.50,252286.01,220770.01,0.00,31516.00,17.63,0.00,0.00
131,256,15782.72,252442.55,220878.11,0.00,31564.44,17.63,0.00,0.00
132,256,15782.79,252374.70,220813.11,0.00,31561.59,17.63,0.00,0.00
133,256,15766.69,252400.07,220861.69,0.00,31538.38,17.63,0.00,0.00
134,256,15783.71,252434.45,220874.02,0.00,31560.43,17.63,0.00,0.00
135,256,15774.03,252448.41,220896.36,0.00,31552.05,17.63,0.00,0.00
136,256,15769.19,252386.04,220845.66,0.00,31540.38,17.63,0.00,0.00
137,256,15780.51,252435.07,220872.06,0.00,31563.01,17.63,0.00,0.00
138,256,15780.82,252524.19,220965.54,0.00,31558.65,17.63,0.00,0.00
139,256,15774.14,252477.15,220929.88,0.00,31547.27,17.63,0.00,0.00
140,256,15799.20,252505.10,220902.70,0.00,31602.39,17.63,0.00,0.00
141,256,15768.07,252407.15,220875.01,0.00,31532.14,17.63,0.00,0.00
142,256,15775.23,252434.74,220880.27,0.00,31554.47,17.63,0.00,0.00
143,256,15780.97,252519.51,220960.57,0.00,31558.94,17.63,0.00,0.00
144,256,15784.41,252427.53,220859.71,0.00,31567.82,17.63,0.00,0.00
145,256,15770.23,252400.74,220858.27,0.00,31542.47,17.63,0.00,0.00
146,256,15780.55,252539.73,220982.64,0.00,31557.09,17.63,0.00,0.00
147,256,15774.84,252443.47,220891.78,0.00,31551.68,17.63,0.00,0.00
148,256,15791.21,252497.40,220911.97,0.00,31585.42,17.63,0.00,0.00
149,256,15770.79,252429.58,220891.00,0.00,31538.58,17.63,0.00,0.00
150,256,15766.60,252343.60,220805.40,0.00,31538.20,17.63,0.00,0.00
151,256,15776.96,252377.30,220831.39,0.00,31545.91,17.63,0.00,0.00
152,256,15774.86,252435.69,220884.98,0.00,31550.71,17.63,0.00,0.00
153,256,15785.90,252525.33,220951.54,0.00,31573.79,17.63,0.00,0.00
154,256,15773.41,252413.60,220865.77,0.00,31547.83,17.63,0.00,0.00
155,256,15787.02,252490.22,220920.19,0.00,31570.03,17.63,0.00,0.00
156,256,15777.40,252391.41,220835.61,0.00,31555.80,17.63,0.00,0.00
157,256,15758.84,252356.46,220832.78,0.00,31523.68,17.63,0.00,0.00
158,256,15785.67,252443.69,220878.36,0.00,31565.34,17.63,0.00,0.00
159,256,15779.46,252501.43,220941.50,0.00,31559.93,17.63,0.00,0.00
160,256,15767.38,252382.04,220843.29,0.00,31538.75,17.63,0.00,0.00
161,256,15788.15,252411.50,220836.19,0.00,31575.31,17.63,0.00,0.00
162,256,16032.75,256569.03,224509.53,0.00,32059.50,17.95,0.00,0.00
163,256,15847.53,253651.46,221952.40,0.00,31699.06,17.63,0.00,0.00
164,256,15852.06,253560.96,221854.84,0.00,31706.12,17.63,0.00,0.00
165,256,15846.74,253562.79,221867.31,0.00,31695.47,17.63,0.00,0.00
166,256,15838.84,253387.50,221714.81,0.00,31672.69,17.63,0.00,0.00
167,256,15848.34,253474.37,221783.70,0.00,31690.67,17.63,0.00,0.00
168,256,15826.03,253326.48,221667.42,0.00,31659.06,17.32,0.00,0.00
169,256,15838.68,253404.92,221725.55,0.00,31679.36,17.63,0.00,0.00
170,256,15822.90,253211.38,221567.58,0.00,31643.80,17.63,0.00,0.00
171,256,15837.94,253279.06,221609.18,0.00,31669.88,17.63,0.00,0.00
172,256,15813.69,253160.08,221526.69,0.00,31633.38,17.63,0.00,0.00
173,256,15823.42,253133.70,221492.86,0.00,31640.84,17.63,0.00,0.00
174,256,15993.32,255967.09,223973.45,0.00,31993.64,17.63,0.00,0.00
175,256,15845.46,253429.38,221740.46,0.00,31688.92,17.32,0.00,0.00
176,256,15844.52,253596.26,221907.23,0.00,31689.03,17.32,0.00,0.00
177,256,15860.32,253615.19,221894.54,0.00,31720.65,17.32,0.00,0.00
178,256,15844.13,253599.05,221907.79,0.00,31691.26,17.32,0.00,0.00
179,256,15850.45,253509.27,221810.36,0.00,31698.91,17.32,0.00,0.00
180,256,15840.57,253464.06,221778.93,0.00,31685.13,17.63,0.00,0.00
181,256,15836.02,253420.27,221754.24,0.00,31666.03,17.63,0.00,0.00
182,256,15839.45,253470.19,221790.29,0.00,31679.90,17.63,0.00,0.00
183,256,15832.98,253317.66,221648.70,0.00,31668.96,17.63,0.00,0.00
184,256,15832.69,253204.11,221543.72,0.00,31660.39,17.63,0.00,0.00
185,256,15810.91,253140.60,221513.78,0.00,31626.83,17.63,0.00,0.00
186,256,15824.14,253145.18,221501.91,0.00,31643.27,17.63,0.00,0.00
187,256,15820.03,253047.49,221403.43,0.00,31644.06,17.63,0.00,0.00
188,256,15806.51,252981.18,221369.16,0.00,31612.02,17.63,0.00,0.00
189,256,15808.68,252960.87,221342.51,0.00,31618.36,17.63,0.00,0.00
190,256,15800.45,252854.27,221253.36,0.00,31600.91,17.63,0.00,0.00
191,256,15825.49,252983.83,221341.85,0.00,31641.98,17.63,0.00,0.00
192,256,15798.30,252853.73,221252.14,0.00,31601.59,17.63,0.00,0.00
193,256,15816.52,252955.28,221323.25,0.00,31632.04,17.63,0.00,0.00
194,256,15905.28,254463.44,222645.88,0.00,31817.56,17.63,0.00,0.00
195,256,15959.51,255482.15,223565.13,0.00,31917.02,17.63,0.00,0.00
196,256,15842.71,253576.40,221892.98,0.00,31683.42,17.32,0.00,0.00
197,256,15839.13,253377.13,221700.86,0.00,31676.27,17.32,0.00,0.00
198,256,15840.27,253441.33,221757.79,0.00,31683.54,17.32,0.00,0.00
199,256,15838.41,253451.53,221771.71,0.00,31679.82,17.32,0.00,0.00
200,256,15852.39,253541.25,221841.47,0.00,31699.78,17.32,0.00,0.00
201,256,15836.63,253419.15,221743.88,0.00,31675.27,17.32,0.00,0.00
202,256,15964.92,255475.70,223546.86,0.00,31928.84,18.61,0.00,0.00
203,256,15809.84,252940.43,221323.75,0.00,31616.68,18.61,0.00,0.00
204,256,15799.09,252843.50,221241.31,0.00,31602.19,18.28,0.00,0.00
205,256,15809.64,252865.29,221250.00,0.00,31615.29,18.28,0.00,0.00
206,256,15790.12,252774.98,221191.73,0.00,31583.25,18.28,0.00,0.00
207,256,15802.28,252838.45,221230.89,0.00,31607.56,18.28,0.00,0.00
208,256,15797.85,252777.67,221182.96,0.00,31594.71,18.28,0.00,0.00
209,256,15805.56,252780.01,221175.88,0.00,31604.13,18.28,0.00,0.00
210,256,15804.24,252864.78,221252.30,0.00,31612.47,18.28,0.00,0.00
211,256,15800.07,252775.20,221172.05,0.00,31603.15,18.28,0.00,0.00
212,256,15780.74,252630.89,221069.40,0.00,31561.49,18.28,0.00,0.00
213,256,15797.77,252715.35,221122.81,0.00,31592.54,18.28,0.00,0.00
214,256,15797.96,252728.32,221130.41,0.00,31597.92,18.28,0.00,0.00
215,256,15782.39,252657.26,221088.48,0.00,31568.78,18.28,0.00,0.00
216,256,15804.75,252670.96,221065.46,0.00,31605.49,18.28,0.00,0.00
217,256,15786.71,252680.35,221107.93,0.00,31572.42,18.28,0.00,0.00
218,256,15797.67,252657.79,221061.44,0.00,31596.35,18.28,0.00,0.00
219,256,15788.75,252658.95,221079.46,0.00,31579.49,18.28,0.00,0.00
220,256,15787.16,252667.53,221098.22,0.00,31569.32,18.28,0.00,0.00
221,256,15791.49,252673.82,221088.84,0.00,31584.98,18.28,0.00,0.00
222,256,15957.79,255261.61,223344.03,0.00,31917.58,18.28,0.00,0.00
223,256,15814.96,253110.32,221481.41,0.00,31628.91,17.95,0.00,0.00
224,256,15806.56,252898.95,221285.84,0.00,31613.12,17.95,0.00,0.00
225,256,15806.64,252932.26,221318.98,0.00,31613.28,17.95,0.00,0.00
226,256,15797.07,252786.18,221188.03,0.00,31598.15,17.95,0.00,0.00
227,256,15962.39,255276.19,223354.42,0.00,31921.77,17.95,0.00,0.00
228,256,15836.33,253225.33,221555.66,0.00,31669.67,17.95,0.00,0.00
229,256,15822.96,253259.32,221614.40,0.00,31644.91,17.95,0.00,0.00
230,256,15812.15,253064.43,221437.12,0.00,31627.30,17.95,0.00,0.00
231,256,15816.32,253083.14,221450.50,0.00,31632.64,17.95,0.00,0.00
232,256,15799.48,252841.61,221243.66,0.00,31597.95,17.95,0.00,0.00
233,256,15812.00,252964.04,221338.03,0.00,31626.00,17.95,0.00,0.00
234,256,15818.47,253042.45,221403.51,0.00,31638.93,17.95,0.00,0.00
235,256,15795.30,252805.78,221218.18,0.00,31587.60,17.95,0.00,0.00
236,256,15794.06,252722.02,221133.89,0.00,31588.13,17.95,0.00,0.00
237,256,15805.64,252813.23,221200.95,0.00,31612.28,17.95,0.00,0.00
238,256,15807.60,252819.54,221205.35,0.00,31614.19,17.95,0.00,0.00
239,256,15809.57,253062.13,221442.99,0.00,31619.14,17.95,0.00,0.00
240,256,15793.56,252717.97,221129.85,0.00,31588.12,17.95,0.00,0.00
241,256,15795.26,252738.16,221148.64,0.00,31589.52,17.95,0.00,0.00
242,256,15794.57,252670.05,221080.91,0.00,31589.13,17.95,0.00,0.00
243,256,15797.61,252854.76,221253.54,0.00,31601.22,17.95,0.00,0.00
244,256,15798.93,252752.90,221159.04,0.00,31593.86,17.95,0.00,0.00
245,256,15792.67,252714.78,221129.43,0.00,31585.35,17.95,0.00,0.00
246,256,15796.63,252732.08,221136.82,0.00,31595.26,17.95,0.00,0.00
247,256,15804.75,252811.06,221206.55,0.00,31604.51,17.95,0.00,0.00
248,256,15797.28,252656.41,221063.86,0.00,31592.55,17.95,0.00,0.00
249,256,15779.47,252661.51,221098.57,0.00,31562.94,17.95,0.00,0.00
250,256,15806.60,252810.59,221192.39,0.00,31618.20,17.95,0.00,0.00
251,256,16071.91,257219.54,225079.72,0.00,32139.82,17.95,0.00,0.00
252,256,15847.56,253426.00,221732.87,0.00,31693.13,17.95,0.00,0.00
253,256,16053.82,256904.14,224797.50,0.00,32106.64,17.95,0.00,0.00
254,256,16087.01,257387.23,225209.20,0.00,32178.03,19.65,0.00,0.00
255,256,15837.41,253435.58,221758.76,0.00,31676.82,18.95,0.00,0.00
256,256,15827.62,253250.98,221599.73,0.00,31651.25,18.61,0.00,0.00
257,256,15823.62,253109.98,221466.73,0.00,31643.25,18.61,0.00,0.00
258,256,15811.21,253098.38,221473.96,0.00,31624.42,18.28,0.00,0.00
259,256,15821.74,253062.86,221418.38,0.00,31644.48,18.28,0.00,0.00
260,256,15812.28,253047.55,221420.98,0.00,31626.57,18.28,0.00,0.00
261,256,15821.94,253102.05,221460.17,0.00,31641.88,18.28,0.00,0.00
262,256,16132.00,258109.07,225843.06,0.00,32266.01,18.61,0.00,0.00
263,256,15862.71,253846.34,222123.92,0.00,31722.42,18.28,0.00,0.00
264,256,15837.76,253487.11,221805.60,0.00,31681.51,18.28,0.00,0.00
265,256,15845.30,253365.81,221679.21,0.00,31686.60,18.28,0.00,0.00
266,256,15837.18,253387.86,221710.50,0.00,31677.36,18.28,0.00,0.00
267,256,15830.00,253322.01,221664.01,0.00,31658.00,18.28,0.00,0.00
268,256,15829.85,253343.54,221686.84,0.00,31656.70,18.28,0.00,0.00
269,256,15831.44,253173.07,221510.18,0.00,31662.89,18.28,0.00,0.00
270,256,15804.91,253070.47,221456.66,0.00,31613.81,18.28,0.00,0.00
271,256,15828.01,253151.17,221493.14,0.00,31658.02,17.95,0.00,0.00
272,256,15825.60,253146.68,221498.47,0.00,31648.21,18.28,0.00,0.00
273,256,15810.20,253049.27,221427.86,0.00,31621.41,18.28,0.00,0.00
274,256,15815.63,253013.12,221386.85,0.00,31626.26,18.28,0.00,0.00
275,256,15807.86,252942.71,221323.00,0.00,31619.71,18.28,0.00,0.00
276,256,15827.24,252992.87,221339.39,0.00,31653.49,18.28,0.00,0.00
277,256,15899.39,254693.20,222893.42,0.00,31799.77,18.28,0.00,0.00
278,256,15829.55,253201.78,221539.68,0.00,31662.10,18.28,0.00,0.00
279,256,15807.33,252819.21,221211.56,0.00,31607.65,18.28,0.00,0.00
280,256,15784.34,252665.45,221090.77,0.00,31574.68,18.28,0.00,0.00
281,256,15799.06,252697.90,221103.79,0.00,31594.11,18.28,0.00,0.00
282,256,15789.92,252705.67,221126.84,0.00,31578.83,18.28,0.00,0.00
283,256,15788.00,252656.96,221075.96,0.00,31580.99,18.28,0.00,0.00
284,256,15797.36,252687.81,221095.08,0.00,31592.73,18.28,0.00,0.00
285,256,15792.44,252712.06,221128.17,0.00,31583.88,18.28,0.00,0.00
286,256,15802.65,252869.44,221263.13,0.00,31606.31,17.95,0.00,0.00
287,256,15798.77,252659.31,221065.77,0.00,31593.54,17.95,0.00,0.00
288,256,15788.79,252700.61,221118.04,0.00,31582.58,17.95,0.00,0.00
289,256,15790.92,252560.69,220982.86,0.00,31577.84,17.95,0.00,0.00
290,256,15800.46,252859.43,221256.50,0.00,31602.93,17.95,0.00,0.00
291,256,15789.12,252653.85,221077.62,0.00,31576.23,17.95,0.00,0.00
292,256,15792.58,252679.25,221090.10,0.00,31589.16,17.95,0.00,0.00
293,256,15791.10,252577.54,221001.35,0.00,31576.19,17.95,0.00,0.00
294,256,15788.07,252646.19,221070.04,0.00,31576.15,17.95,0.00,0.00
295,256,15781.55,252565.81,220996.71,0.00,31569.10,17.95,0.00,0.00
296,256,15791.78,252671.48,221094.92,0.00,31576.56,17.95,0.00,0.00
297,256,15787.27,252644.33,221063.79,0.00,31580.54,17.95,0.00,0.00
298,256,15804.75,252808.97,221203.48,0.00,31605.50,17.95,0.00,0.00
299,256,15786.74,252627.92,221051.43,0.00,31576.49,17.95,0.00,0.00
300,256,15742.18,251593.18,220179.75,0.00,31413.43,17.95,0.00,0.00
SQL statistics:
    queries performed:
        read:                            66370360
        write:                           0
        other:                           9481480
        total:                           75851840
    transactions:                        4740740 (15799.78 per sec.)
    queries:                             75851840 (252796.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0495s
    total number of events:              4740740

Latency (ms):
         min:                                    1.33
         avg:                                   16.20
         max:                                  292.33
         95th percentile:                       17.95
         sum:                             76790496.05

Threads fairness:
    events (avg/stddev):           18518.5156/440.50
    execution time (avg/stddev):   299.9629/0.01